Revit 2027 API
ForbiddenForDynamicUpdateException Class
The exception that is thrown when making or attempting to make changes that are forbidden during dynamic updates to the model.
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[SerializableAttribute]
public class ForbiddenForDynamicUpdateException : InvalidOperationException
<SerializableAttribute>
Public Class ForbiddenForDynamicUpdateException
	Inherits InvalidOperationException
[SerializableAttribute]
public ref class ForbiddenForDynamicUpdateException : public InvalidOperationException
[<SerializableAttribute>]
type ForbiddenForDynamicUpdateException =
    class
        inherit InvalidOperationException
    end
The ForbiddenForDynamicUpdateException type exposes the following members.
Properties
Name | Description
Data | Gets a collection of key/value pairs that provide additional user-defined information about the exception.
(Inherited from Exception)
FunctionId | The information of the function throwing the exception.
(Inherited from ApplicationException)
HelpLink | Gets or sets a link to the help file associated with this exception.
(Inherited from Exception)
HResult | Gets or sets HRESULT, a coded numerical value that is assigned to a specific exception.
(Inherited from Exception)
InnerException | Gets the Exception instance that caused the current exception.
(Inherited from Exception)
Message | Gets a message that describes the current exception.
(Inherited from Exception)
Source | Gets or sets the name of the application or the object that causes the error.
(Inherited from Exception)
StackTrace | Gets a string representation of the immediate frames on the call stack.
(Inherited from Exception)
TargetSite | Gets the method that throws the current exception.
(Inherited from Exception)
Top
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBaseException | When overridden in a derived class, returns the Exception that is the root cause of one or more subsequent exceptions.
(Inherited from Exception)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetObjectData | Retrieves data needed to serialize the target object.
(Overrides InvalidOperationException.GetObjectData(SerializationInfo, StreamingContext))
GetType | Gets the runtime type of the current instance.
(Inherited from Exception)
ToString | Creates and returns a string representation of the current exception.
(Inherited from Exception)
Top
Remarks
Modifications leading to a new mutual relationship between elements that did not depend on each other before are potentially not safe in work-set environment. This exception is thrown when an Updater either makes such modifications or attempts to call a method that will or may modify the model in such unsafe matter.
See Also
Reference
Autodesk.Revit.Exceptions Namespace